import pandas as pd

# Чтение файла Excel
input_file = "123.xlsx"  # Замените на путь к вашему файлу
output_file = "очищенный_файл.xlsx"  # Имя файла для сохранения результата

# Загрузка данных
data = pd.read_excel(input_file)

# Удаление строк с ненужными значениями в ParamValue
unwanted_values = ["", " ", "-", "1", "нет", "жалобы нет", "Жалоб нет", "нет.", "Жалобы: нет","-.","----------","0","11","111","123","-----------",".","1, 1","1ё","45","12","2","Анамнез жизни:",
                   "Анамнез жизни:0","Анамнез жизни:1","Анамнез жизни: -","Анамнез жизни:  -.","Анамнез жизни:  .","Анамнез жизни: 0"
                   ,"Анамнез жизни: 1","Анамнез жизни:  123","Анамнез жизни:  11","Анамнез жизни:  1","Анамнез жизни:  -","Анамнез жизни:  0","Жалобы:  жалоб нет","123, 123"
                   ,"ф","жалоб нет","благополучный .","Жалобы:  нет.","Жалобы:  активных нет","Жалобы:  Жалоб нет.","Жалобы:  1","Жалобы:   нет","Анамнез жизни:  благополучный ."
                   ,"Анамнез жизни:  не отягощен","Жалоб нет.","Жалобы:   жалоб нет","Жалобы:  нет","Жалобы:  нет.-.","НЕТ","Нет","Нет.","активных нет","не отягощен","спокоен"]

# Преобразуем столбец ParamValue к строковому типу, заменяя NaN на пустые строки
data["ParamValue"] = data["ParamValue"].fillna("").astype(str).str.strip()

# Фильтрация: удаление строк с нежелательными значениями
data_cleaned = data[~data["ParamValue"].isin(unwanted_values)]

# Сортировка по столбцу ParamValue
data_sorted = data_cleaned.sort_values(by="ParamValue")

# Сохранение результата
data_sorted.to_excel(output_file, index=False)

print(f"Обработанный файл сохранен как {output_file}")